/* 
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */



            var name = [["直线加速器","高能输运线","高能输运线二极磁铁","高能输运线二极磁铁电源",
                    "高能输运线四极磁铁","高能输运线四极磁铁电源","高能输运线校正磁铁(H/V)","高能输运线校正磁铁(H/V)电源",
                "高能输运线真空系统","高能输运线磁铁安装公差", "增强器","增强器高频系统","增强器辐射防护","增强器磁铁校正子电源",
            "增强器磁铁安装公差","增强器磁铁四极铁电源","增强器磁铁六极铁电源","增强器磁铁二极铁电源","增强器真空系统",
        "增强器注入引出系统","增强器校正磁铁","增强器束测系统","增强器四极磁铁","增强器六极磁铁","增强器二极磁铁 BD 类型 II",
    "增强器二极磁铁 BD 类型 I","低能输运线","低能输运线二极磁铁","低能输运线二极磁铁电源","低能输运线切割磁铁","低能输运线四极磁铁","低能输运线四极磁铁电源",
"低能输运线校正磁铁(H/V)","低能输运线校正磁铁(H/V)电源","低能输运线真空系统","低能输运线磁铁安装公差","人员保护","主环","主环真空系统",
"主环二极磁铁电源","主环八极磁铁电源","主环八极铁","主环六极磁铁电源","主环六极铁","主环六极铁绑腿形式水平垂直校正磁铁","主环四极磁铁电源",
"主环四极铁一型(超高梯度四极铁)","主环四极铁二型","主环弯转磁铁一型 (反向) (纵向梯度二极磁铁)","主环弯转磁铁一型 (正向) (纵向梯度二极磁铁)","主环弯转磁铁三型 (四极铁型二极铁)",
"主环弯转磁铁二型 (四极铁型二极铁)","主环快校正磁铁电源","主环校正磁铁电源","主环注入引出系统","主环独立水平垂直校正磁铁"],
                ["物理","电源","准直","真空", "束测","高频","人员保护"]];
            
    function getChange() {
    var p = document.form1.parent;
    var c = document.form1.child;
    
    var namec = name[p.selectedIndex-1];
     c.length = 0;
     
     for(var i=0;i<namec.length;i++){
         c[i]= new Option(namec[i],namec[i]);
     }
   }
